**free
/if not defined(COPYRIGHT_DSPEC)
ctl-opt copyright('V1.2 - 08.06.2026 - mailto: thomas.raddatz@tools400.de');
/eof
/endif
dcl-c WHOAMI_VERSION '1.2';
dcl-c WHOAMI_DATE '08.06.2026';
